{"id":"MDEwOkRpc2N1c3Npb24zNDY4ODQ1","title":"自学总结・入门期","bodyHTML":"<blockquote>\n<p dir=\"auto\">背景：<br>\n为了学习技术，希望自己设计开发一个 blog，并尽可能多的使用到新技术。每日写总结记录开发中遇到的问题，进行思考总结</p>\n</blockquote>\n<p dir=\"auto\">2016-12-25<br>\n今天的效率很低，犯了很多习惯性的错误。就是在做一件事情的时候不能先去完成一部分，去做后续的测试。当你把整个手头上的东西都完成后，才发现后续的步骤根本行不通时，才发现自己走了好多冤枉路。<br>\nTODO: 纠正自己的思维惯式，提高自己遇到新问题时的分析及处理能力。<br>\nSUM: 当在处理新问题时，注意自己的方式方法，尽量避免习惯上认知。</p>\n<p dir=\"auto\">2016-12-26<br>\n今天装逼卖萌一波，进度有点缓慢。本来想着要把字体生成出来。没想到 AI(Adobe Illustrator) 真 TM 的太好玩了，搞起来就撒不了手。真所谓自作孽不可活。哈哈。<br>\nSUM: 凡事要有节制。哈哈，只能这么安慰自己了。</p>\n<p dir=\"auto\">2016-12-27<br>\n今天 AI(Adobe Illustrator) 是玩爽了，但是生成字体因间距太大已被舍弃，也就字体图标能用用了，倒腾了几天然并卵（这真是表面光鲜亮丽，背后却还是一坨屎。到目前为止。需要的图标已差不多 OK，ai，fontforge 就先暂且放一放）。还是老老实实码代码吧。<br>\nSUM: 实用性永远是第一位的，不能用一切都是白搭。</p>\n<p dir=\"auto\">2016-12-30<br>\nDONE: router, file-upload, node console -&gt; font color<br>\nSUM: 每天给自己十到十五分钟的时间总结一天所学，不为别的，只是觉得自己以前浪费了好多时间，总为自己的懒惰找借口，三天打鱼 两天晒网。或多或少，当哪一天没有一点可写的东西时，就该反思一下自己了。每天发朋友圈，空间不是为了获得别人的点赞和赞赏（又装逼了，因为将来能回头看看自己走过的路，知道自己进步了多少，要是我每天的装逼言论能“刺激”到一些人，也不错。哈哈）量变到质变，不是看你哪天完成了多少多少东西。一步一个脚印，踏实！</p>\n<p dir=\"auto\">2017-01-01<br>\nDONE: 对 JavaScript base: apply , call, bind 的理解又比以前深入了。貌似今天没啥进步，就把一些要素重新梳理了一下。做这个项目，给我带来的最大感受就是能够系统的梳理自己清楚的，不清楚的的犄角旮旯里的各种知识。哈哈。总之觉得自己每天的进度都很缓慢。每前进一步都是一次学习。思考问题不能站在某一个角度了，必须🉐️从整个项目出发。从中我也发现了我的选择恐惧症。就爱对比。用 plugins 就要用最好的。在筛选这些时免不了看看介绍啥的，白花花的时间都跑了😭。后来总结出来了一个结论。用下载量最大的准没错。哈哈（这也是有科学依据的，用的人越多，对该 plugin 的测试也就越全面，出现大 bug 的可能性就越小，虽然用小众的在自己的项目中不一定会出现 bug，但我就喜欢跟风嘛，哈哈。要死大家一起挂。）</p>\n<p dir=\"auto\">2017-01-02<br>\nDONE: 在使用 yarn 时遇到大坑，引用 jquery 库时只能从 node_modules 下引用，路径有点看着不爽，但又不知如何解决（莫不是有高级玩法我不知道？😭）。google 了一大堆也没找到合适的方案（或许我没搜索到位）。只好退而求其次，又搞过来一个 bower（能够实现自定义安装路径，我喜欢😜）来管理 jquery  ...第三方库，感觉一个项目两个包管理器终究还是不爽。但目前想不到更好的方案了（谁让我就是这么矫情，就是看不惯它的安装路径，我尝试用 gulp 重新 build 一下，但没成功。回头再试试，或者还可以试试 fs 模块，重写文件），只能等到日后再想办法解决。<br>\nTODO: Browserify 或许是一个不错的方案<br>\nSUM: 有些事要么不做，要做就要做到极致。敢于追求完美，才有可能将一件事做到近乎完美。（虽然以我目前的能力，不可能把它做到做好，但我会尽我所能不将究。然后不断的优化）</p>\n<p dir=\"auto\">2017-01-03<br>\nDONE:<br>\nPug: mixin -&gt; list<br>\nSass: mixin (responsive, z-index, ...)<br>\n...<br>\nTODO:<br>\n响应式网站（不借助 bootstrap 框架，实现整站布局。因为要做个性化，所以还是手写更靠谱些😪）<br>\n如何将代码 (router, pug, sass, ...) 进行模块化(功能化)拆分，提高复用性及可维护性，以及后期整个项目的可扩展性（说着容易，做起来，也是不断的进行自我总结优化。进度没有想象中的那么快😒）<br>\n目标：博客只是整个项目的一个板块，但是 .md or .org 的文件编译及发布虽然已在脑海形成轮廓。但感觉坑应该不会少🤔。<br>\n数据库...<br>\n可以考虑的：整站的一个配置文件-&gt;常用设置</p>\n<p dir=\"auto\">2017-01-04<br>\nDONE: Home 布局已完成一半，由于要响应多个设备，还在不断的调整中。项目结构在构建页面时又进行了一次调整，按照类型对pug 进行功能化分类。目前感觉比较合理(后期还有可能再次调整)，便于路由的管理。</p>\n<p dir=\"auto\">2017-01-05<br>\nDONE: Home 页布局已基本完成，接下来要做的就是如何将容器中的内容进行参数化，设置配置文件（这样在内容调整时就不会就不需要直接改页面，方便，也不容易出错。因为经常性的改页面，不定哪天就破坏了页面的结构。配置文件只是一个过渡，下一步可能会去实现的功能将是后台编辑的功能，但目前不考虑）。js 文件的压缩与合并的 task 已完成，下一步要做的就是一些特效，如产生滚动条时，出现返回页面顶部的 🔘。banner 处的图片轮播。<br>\nTODO: 目前还在构思的是用 css3 实现一些页面的动画效果，使过度更自然平滑，更酷（其实是装逼用的）。哈哈。logo 看着有点不太舒服，下一步可能还需要考虑 logo 的问题。大结构已经基本完成，会有细节上的调整（字体大小，颜色，背景等等）。</p>\n<p dir=\"auto\">2017-01-06<br>\n今天一天没啥进度，页面的结构我现在越来越拿捏不准了。怎么看都不好看...<br>\nsass 写了两 mixin，css3 animation 写了几个动画，但真心觉得好丑。看来不能在 UI 美化上浪费时间了（凡事都想做到极致，就容易纠结，光一个颜色都能纠结半天，我自己反正拿我是没辙了，唉）。先搞开发吧，留着以后慢慢纠结。<br>\n还想说的就是 atom 搞了我大半天时间，插件配置的还是不理想，只能暂时放下了。看来以后 IDE 也少折腾吧，浪费的都是白花花的时间，唉。干啥啥不顺。</p>\n<p dir=\"auto\">2017-01-07<br>\nDONE: 了解了一些 sassdoc，jsdoc，svg。项目结构进行了一点微调（sass），浏览器终端判断<br>\nTODO: 突然发现自己移动端欠缺好多基础，就一个菜单的点击事件我还没想明白...😩。明天学习移动端基础。</p>\n<p dir=\"auto\">2017-01-08<br>\nDONE: 这两天没有急于完成其他的的页面(其实好的开始就是成功的一半，当一个页面考虑的足够全面时，其实其他的页面都类似，只是一些功能的不同或增减)，在写 js 时发现了一些问题(sass，pug 的结构不太合理，样式及页面的可扩展性也不好[比如我后期要扩展导航，页面结构就会发生变化，我当时的想法是后期只扩展二级菜单，一级菜单所涵盖的范围要足够广，这样我就可以将导航布局写死。但经过这两天的思考，我觉得之前的设计其实是不合理的，因为我不能保证以后会不会出现一级菜单。虽然改代码也不难，但我觉得这种设计是愚蠢的，无形中给将来埋了一颗雷]，sass 比较让我头疼，可自己又不知如何去写，所以我现在在看 bootstrap源码，从中提炼出一套适合自己的样式框架，bootstrap 有很多思想是可以借鉴的，但是有很多样式其实自己是不需要的，我所需要做的就是提炼出其中的元素，重新编写自己的一套 mixin，function，%, etc.)。所以鉴于此原因，准备重写页面。合理的结构就是在不断修改中逐渐成型的，虽然目前以我的能力不足以写出一个合理的结构。但我会一步步的去改进完善它。<br>\nTODO:<br>\n样式命名规则：凡是 js 操作的 class 前面都加 js-；<br>\n凡是多次重用的样式都写成 mixin，function，or placeholder；<br>\n对 sass 按照功能 or 类型进行分类，便于管理与扩展；(e.g., alert, error, button)<br>\n多多考虑页面的体验与交互。(页面的一些缓冲效果，动画等)</p>\n<p dir=\"auto\">2017-01-09<br>\nDONE: grid 已基本完成。bootstrap 作者设计的栅格系统的确很巧妙，将列宽与要响应的断点结合的很完美(至少在没看源码之前我是没想到，哈哈，看了也没看太明白，而且再一次的感受到了 mixin 的强大。原理是通了，但是代码还没全搞明白)。<br>\n明天继续把 grid 彻底搞通。然后进行下一步... TODO: 下一步就是把网页所有的元素分类进行管理 (font，border，button，...)。</p>\n<p dir=\"auto\">2017-01-10<br>\nDONE: (自动化)写了那么久的代码直到今天才觉得自己是在写代码了。编程需要的思想也慢慢体会到了，以前只是为了完成任务而完成任务。计算机的优势就是计算，重复计算。在计算机中，人最不需要做的就是重复，需要的是一种思想，可以让计算机帮你去完成重复工作的逻辑与思想。<br>\n虽然今天没做多少东西[就写了几个页面小部件]，但我觉得我进步了。因为我现在实现一个功能不是单纯的的靠代码的堆砌，为了实现一个功能而去做一个功能。每写一个功能其实都是一个方法/函数集合体，只有这样才能提高复用性及后期的可扩展性。</p>\n<p dir=\"auto\">2017-01-11<br>\nDONE: 寻找灵感。。。顺便巩固js基础。我现在已经被canvas深深的吸引了。程序和艺术可以结合的这么完美。<br>\nTODO: 明天开始建站。由于自己之前太笨，结构没设计好，只能重做。这次用自己的一套 grid 和 media 相信页面结构应该会比较容易控制，而且也不存在多余的代码。垃圾代码少了，样式覆盖的问题应该能好点(虽然我水平就这样，但我尽量保证不制造垃圾，🤔)</p>\n<p dir=\"auto\">2017-01-12<br>\nDONE: 做了一个环形进度条。。。准备学习 webpack。</p>\n<p dir=\"auto\">2017-01-13<br>\nDONE: webpack.config.js。万事具备，似乎可以开始了。<br>\nSUM: 不知不觉中就已过去了 20 天。学到了很多，但是不幸的是发现不会的更多了。原来，知道与不知道是成正比的，知道的越多，才发现不知道的也愈多。(好奇害死猫，不好奇，也许猫不会死，但那还是猫吗？。。。)</p>","category":{"name":"Notes"},"labels":{"edges":[]},"reactions":{"totalCount":0,"edges":[]},"comments":{"edges":[]}}